In [50]:
## Python Basics
## Map, Apply, ApplyMap operation
kill= pd.read_csv(r'C:\Users\shumondal\Desktop\data\PoliceKillingsUS.csv', encoding="windows-1252")
data=kill[['id','city']].head(5)
data

## map function - map() method only works on a pandas series, or any individual columns or functions
#where type of operation to be applied depends on argument passed as a function, dictionary or a list.
data1=data.id.map(lambda x: x+10)
data['newid']=data1
data.drop(['id'],axis=1)

def multiply(v):
    d=v*100
    return d

data['newid'].map(lambda x: multiply(x))

0    1300
1    1400
2    1500
3    1800
4    1900
Name: newid, dtype: int64

In [59]:
## apply() method can be applied both to series and dataframes.We can apply on multiple columns to do operations
data=kill[['id','city','age']].head(5)
dataApp=data[['id','age']].apply(multiply)
dataApp

    id     age
0  300  5300.0
1  400  4700.0
2  500  2300.0
3  800  3200.0
4  900  3900.0

In [60]:
## applymap() method only works on a pandas dataframe where function is applied on every element individually.
## if you do want operation on entire dataframe consisting int or float value, you do not have to specify multiple colums 
## explicitely

dataApplyMap=dataApp.applymap(multiply)
dataApplyMap

      id       age
0  30000  530000.0
1  40000  470000.0
2  50000  230000.0
3  80000  320000.0
4  90000  390000.0

In [62]:
## Now combine with Lambda function for the above method
## Multiply function can be written with lambda func and apply for map method
dataApp.id.map(lambda x: x * 10)

0    3000
1    4000
2    5000
3    8000
4    9000
Name: id, dtype: int64

In [92]:
## Multiply function can be written with lambda func and apply for apply method
dataApp
dataApp.apply(lambda x: (x[0] * 2 , x[1] *2), axis=1)

0    (600.0, 10600.0)
1     (800.0, 9400.0)
2    (1000.0, 4600.0)
3    (1600.0, 6400.0)
4    (1800.0, 7800.0)
dtype: object

In [96]:
## Multiply function can be written with lambda func and apply for applymap method, All the numerical  column will be modified 
## without specigifcation
dataApp.applymap(lambda x: x +2)

    id     age
0  302  5302.0
1  402  4702.0
2  502  2302.0
3  802  3202.0
4  902  3902.0